{
    "Main": {
        "HQ": "Headquarters, the main building in Boom Beach that you must protect and upgrade.",
        "Boom Beach": "A game where you build a base and attack other bases.",
        "resource base": "A special base in Boom Beach that contains resources you can collect and defend."
    },
    "Support": {
        "sentry": "A defensive building in Boom Beach that fires at enemy troops and vehicles.",
        "medkit": "An item used to heal troops during battle.",
        "landing craft": "A boat used to send in troops in battle."
    },
    "Defences": {
        "sniper tower": "The first defensive building you unlock in Boom Beach; basic and reliable.",
        "flamethrower": "A defensive building that deals area-of-effect damage to enemy troops."
        "boom cannon": "A powerful defensive building that deals high damage to enemy troops and vehicles.",
        "shock launcher": "A defensive building that temporarily disables enemy defenses with electrical shocks.",
        "rocket launcher": "A defensive building that fires rockets, causing splash damage to enemy troops and vehicles."
    },
    "Economy": {
        "resource base": "A special base in Boom Beach that contains resources you can collect and defend.",
        "vault": "A building where you store your resources to protect them from raids.",
        "trading post": "A building where you can trade resources with other players or the game."
    },
    "Battle": {
        "medkit": "An item used to heal troops during battle.",
        "flares": "A tactical item used to direct troops to a specific location during battle.",
        "smoke screen": "An item that hides troops from enemy defenses for a short period."
    },
    "Events": {
        "Warships": "A special event in Boom Beach where players use Warships to battle others.",
        "Mega Crab": "A recurring event where players fight a massive crab boss with increasing difficulty.",
        "Dr. T": "A recurring event where players battle Dr. Terror and his bases."
    },
    "Funny": {
        "boom surprise": "A term used to describe unexpected moments or surprises in Boom Beach.",
        "attack that boom cannon": "A phrase derived from a popular commercial, used humorously in the community."
    },
    "Miscellaneous": {
        "scout": "A type of reconnaissance unit used to gather information.",
        "prototype defence": "Advanced defensive buildings with unique abilities, often available during special events."
    }
}
